Repository: masa-iwm/UiaTrigger
Catalog: src/UiaTrigger.App.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp

# WindowTitle
source: UiaTrigger sample host
ja_jp: UiaTrigger サンプルホスト

# OpenPickerButton.Content
source: Add with the picker
ja_jp: ピッカーで追加

# OpenAnotherPickerButton.Content
source: Open a second picker
ja_jp: ピッカーをもう 1 つ開く

# DeleteButton.Content
source: Delete
ja_jp: 削除

# ReloadButton.Content
source: Reload
ja_jp: 再読込

# EditListButton.Content
source: Edit the list…
ja_jp: 一覧を編集…

# StartMonitorButton.Content
source: Start monitoring
ja_jp: 監視を開始

# StopMonitorButton.Content
source: Stop monitoring
ja_jp: 監視を停止

# CombineButton.Content
source: Combine the selected
ja_jp: 選択をまとめる

# ListSplitter.AutomationProperties.Name
source: Resize the trigger list
ja_jp: トリガー一覧の高さを変える

# ExpressionLabel.Text
source: Expression (&&, ||, !, parentheses; blank = require all):
ja_jp: 式 (&&, ||, !, 括弧。空欄ならすべてを要求):

# UnwatchedLabel.Text
source: Only narrow, never fire (names, comma separated):
ja_jp: 絞るだけで発火させない条件 (名前をカンマ区切り):

# TriggerCount
source: {0} trigger(s)
ja_jp: {0} 件

# TriggerCountSaved
source: {0} trigger(s), saved
ja_jp: {0} 件 (保存済み)

# LoadFailed
source: Could not read the trigger file: {0}
ja_jp: トリガーファイルを読み込めませんでした: {0}

# SaveFailed
source: Could not write the trigger file: {0}
ja_jp: トリガーファイルを保存できませんでした: {0}

# NoClauses
source: (no condition)
ja_jp: (条件なし)

# CompositeRow
source: [{0}] {1} condition(s) / {2} : {3}
ja_jp: [{0}] 条件 {1} 個 / {2} : {3}

# CombineFailed
source: Could not combine: {0}
ja_jp: まとめられませんでした: {0}

# CombineDone
source: Created '{0}' from {1} trigger(s).
ja_jp: {1} 件から '{0}' を作りました。

# MonitorStarted
source: Monitoring {0} trigger(s) over {1} element(s)
ja_jp: {0} 件 (要素 {1} 個) を監視中

# MonitorStopped
source: Monitoring stopped
ja_jp: 監視を停止しました

# MonitorStartFailed
source: Could not start monitoring: {0}
ja_jp: 監視を開始できませんでした: {0}

# MonitorRowFired
source: {0:T} FIRED [{1}] {2} : '{3}' → '{4}'
ja_jp: {0:T} ★発火 [{1}] {2} : '{3}' → '{4}'

# MonitorRowResolved
source: {0:T} resolved [{1}] : {2}
ja_jp: {0:T} 解決 [{1}] : {2}

# MonitorRowUnresolved
source: {0:T} UNRESOLVED [{1}] : {2}
ja_jp: {0:T} 未解決 [{1}] : {2}

# MonitorRowError
source: {0:T} ERROR {1}
ja_jp: {0:T} 例外 {1}
